---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenLoop
source: html/ca7e7e9e-95cd-5634-26f9-68f4b4977860.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenLoop Property

Lines must be in closed loops. The highlighted lines are open on one end.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpenLoop { get; }
```